{
    "type": "Convolutional Neural Network",
    "resource": "Keras",
    "params": {
        "class_name": "Model",
        "config": {
            "name": "model_1",
            "layers": [
                {
                    "name": "input_1",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            24,
                            6,
                            1
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "name": "input_1"
                    },
                    "inbound_nodes": []
                },
                {
                    "name": "conv2d_1",
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_1",
                        "trainable": true,
                        "filters": 16,
                        "kernel_size": [
                            5,
                            1
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "inbound_nodes": [
                        [
                            [
                                "input_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "elu_1",
                    "class_name": "ELU",
                    "config": {
                        "name": "elu_1",
                        "trainable": true,
                        "alpha": 0.10000000149011612
                    },
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "max_pooling2d_1",
                    "class_name": "MaxPooling2D",
                    "config": {
                        "name": "max_pooling2d_1",
                        "trainable": true,
                        "pool_size": [
                            5,
                            1
                        ],
                        "padding": "same",
                        "strides": [
                            5,
                            1
                        ],
                        "data_format": "channels_last"
                    },
                    "inbound_nodes": [
                        [
                            [
                                "elu_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "conv2d_2",
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_2",
                        "trainable": true,
                        "filters": 32,
                        "kernel_size": [
                            9,
                            1
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "inbound_nodes": [
                        [
                            [
                                "max_pooling2d_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "elu_2",
                    "class_name": "ELU",
                    "config": {
                        "name": "elu_2",
                        "trainable": true,
                        "alpha": 0.10000000149011612
                    },
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_2",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "max_pooling2d_2",
                    "class_name": "MaxPooling2D",
                    "config": {
                        "name": "max_pooling2d_2",
                        "trainable": true,
                        "pool_size": [
                            7,
                            1
                        ],
                        "padding": "same",
                        "strides": [
                            7,
                            1
                        ],
                        "data_format": "channels_last"
                    },
                    "inbound_nodes": [
                        [
                            [
                                "elu_2",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "conv2d_3",
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_3",
                        "trainable": true,
                        "filters": 64,
                        "kernel_size": [
                            13,
                            1
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "inbound_nodes": [
                        [
                            [
                                "max_pooling2d_2",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "elu_3",
                    "class_name": "ELU",
                    "config": {
                        "name": "elu_3",
                        "trainable": true,
                        "alpha": 0.10000000149011612
                    },
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_3",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "max_pooling2d_3",
                    "class_name": "MaxPooling2D",
                    "config": {
                        "name": "max_pooling2d_3",
                        "trainable": true,
                        "pool_size": [
                            9,
                            1
                        ],
                        "padding": "same",
                        "strides": [
                            9,
                            1
                        ],
                        "data_format": "channels_last"
                    },
                    "inbound_nodes": [
                        [
                            [
                                "elu_3",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "flatten_1",
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_1",
                        "trainable": true,
                        "data_format": "channels_last"
                    },
                    "inbound_nodes": [
                        [
                            [
                                "max_pooling2d_3",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "dense_1",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_1",
                        "trainable": true,
                        "units": 2,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "inbound_nodes": [
                        [
                            [
                                "flatten_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "dropout_1",
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_1",
                        "trainable": true,
                        "rate": 0.5,
                        "noise_shape": null,
                        "seed": null
                    },
                    "inbound_nodes": [
                        [
                            [
                                "dense_1",
                                0,
                                0,
                                {
                                    "training": true
                                }
                            ]
                        ]
                    ]
                },
                {
                    "name": "dense_2",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_2",
                        "trainable": true,
                        "units": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "inbound_nodes": [
                        [
                            [
                                "dropout_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                }
            ],
            "input_layers": [
                [
                    "input_1",
                    0,
                    0
                ]
            ],
            "output_layers": [
                [
                    "dense_2",
                    0,
                    0
                ]
            ]
        },
        "keras_version": "2.2.4",
        "backend": "tensorflow"
    },
    "features": 6,
    "stats": {
        "n_instances_trained": 51,
        "dataset_stats": {
            "Longitude": {
                "mean": -1.4210018039215686,
                "std": 0.03273473054784453
            },
            "Latitude": {
                "mean": 50.91265715686275,
                "std": 0.005862236845959485
            },
            "Temperature": {
                "mean": 8.156862745098039,
                "std": 1.538684809161839
            },
            "Precipitation": {
                "mean": 0.4137254901960785,
                "std": 0.7509522341518806
            },
            "Humidity": {
                "mean": 80.27450980392157,
                "std": 6.392638018700822
            },
            "WindSpeed": {
                "mean": 27.274509803921568,
                "std": 9.776078108888061
            }
        }
    }
}